{
  "title": "1 simple trick to understand digital business cases",
  "tags": [
    {
      "tag": "Business",
      "icon": "domain"
    },
    {
      "tag": "Digitalization",
      "icon": "blur"
    },
    {
      "tag": "Humans",
      "icon": "account"
    },
    {
      "tag": "Machines",
      "icon": "robot"
    }
  ],
  "date": "2018-08-19T20:00:00+02:00",
  "thumbnail": "/images/uploads/pexels-photo-1181534_resized.jpeg",
  "summary": "Pricing an Information is pretty difficult because it is highly contextual. However there is a mental trick which can help you making your digital business cases.",
  "body": "# Brainstorming on digital business ideas can be confusing\n\nSeveral weeks ago, a senior colleague called me to take part to a workshop. The goal of the workshop was to help some high profile executives of our customer to find relevant use-cases for new digital projects. We didn't have much time to prepare, so we met shortly with our customer before the workshop to discuss the objectives and frame the schedule of the afternoon. Overall, the plan we proposed was simple: summarize all the databases they know they have at hand, brainstorm on what valuable information we can derive from it and make a basic value assessment of each idea. In the end, we would do a collective voting on what idea seemed the most valuable and accessible to do.\n\nThen the afternoon began. We were in a old room, with carpet on the walls and a huge oval table occupied most of the place. I felt that this room was more suited to have hours-long boring \"death by powerpoint\" meetings than for a productive workshop. The setup was not optimal, but at least there was two white-boards. We began the setup.\n\nThings went smoothly during the beginning of the workshop. Those executives had a great sharing mindset and quickly we identified all kinds of corporate databases they were using in their daily professional life. Collaboratively, we found several ideas of new information we could derive: forecasts, aggregates, predictions, etc. We had eaten half of the time for the workshop and up until that point, everything went smoothly. My colleague and I were comforted about it since we had not much time for preparation.\n\nThen we started the second phase of the brainstorming: the convergence. _\"Now that we have identified new informations we can compute, let's assess their value and rank them.\"_\n\nIt was half past 16. People's listening abilities start to decline at that point. The executives we had in the room were really having trouble agreeing on the relative value of each information. Discussions were going round in circles. In fact, nobody in the room was able to put a clear figure on the value.\n\nIn fact, they were discovering the fact that **Information Value is highly contextual**. The value of information depends on how you use it. How can we determine its value then ?\n\n# The Information Value Equation\n\nInformation is intangible and can be duplicated at will without any cost. So, at first sight, since its marginal cost of production is near zero, one could argue that Information doesn't have any economic value _per se_. However, seeing today's economy, Information is highly valuable. How this intangible Information relates to the tangible, physical world ?    \n\nRonald Howard, a professor of Engineering-Economic systems at Stanford University, brought a solution to this paradox in 1966 in his paper _Information Value Theory_:\n> \"The value of information arises from the probabilistic and economic factors that affect decisions.\" ([Howard, 1966](https://doi.org/10.1109/TSSC.1966.300074))\n\nIn other words, Information is valuable because it affects our decisions. Or, said in another way: Information Value is \"How much answering a question allows a decision-maker to improve its decision\".\n\nLet's take the example of weather forecasts:\n\n- Working in an office, I don't need to know the weather more precisely than when I'm leaving home on the morning, to know if I have to grab an umbrella before leaving or not. \"Should I grab an umbrella ?\" is the key decision here. Several outcomes from this decision: If it rains but I don't have an umbrella, I'll get soaked and I can live with it. That's why I wouldn't pay for 1-day-in-advance weather forecast.\n\n- Imagine now that I'm organizing a promotional event for my company in 2 weeks. The event takes place outside. I've already spent money to organize the event, but I haven't rented a tent, because I think that the weather will be nice. The key decision here is \"Should I rent a tent ?\".\n  - A weather forecast now tells me that there is a 30% chance that it will rain that day. I decide to not rent that tent because I don't want to spend money to protect myself from an event that is too unlikely and I will cancel the event at the last minute if needed.\n  - Later, another forecast tells me that there is a 90% chance that it will rain that day: this time, I decide to rent a tent because canceling the event is a waste of money that is becoming more and more likely.\n\nDepending on the cost I've already spent on the event & the cost of renting a tent, the known likelihood of raining that day will change my decision of renting that tent or not. This likelihood has Value in this context: it means real money for me & the company renting the tent !\n\nThe simplest way to put it is with this equation, which I call the _Information Value Equation_:\n\n<center>\n\n> **📊 Information + ✋ Decision = 💰 Value**\n\n</center>\nIt is not a real equation, but it is a good mnemonics to remember the interaction between those 3 concepts. No decision, no value !\n\n# Use the Information Value Equation on the spot\n\nGetting back to the workshop with our client's company executives: as they couldn't agree on Information Value, discussions were going round in circles. People were starting to have weird looks at my colleague and I, kind of saying: \"where are we going with this workshop ?\".\n\nAt that point our white-boards had 2 columns: _Information_ & _Value_. And the \"Value\" column was desperately empty.\n\n<center>\n\n| Information | Value |\n|:------:|:------:|\n|Predicted next month stock|?|\n|...|?|\n\n</center>\nClearly, this wasn't the right tool to understand & assess the value of each information. It was more misleading than helping them.\n\nI came up with the idea of this Information Value Equation while writing my MBA thesis several weeks before. Feeling that we were stuck, I decided to give it a go: I gathered the participants around me, explained them the Information Value equation and then I simply draw the _Decision_ column between the _Information_ & _Value_ columns. That way, the link could be done easily visually.\n\n<center>\n\n|Information|Decision|Value|\n|:--:|:--:|:--:|\n|Predicted next month stock|How many stuff should I produce this month ?|?|\n|...|...|?|\n\n</center>\nAfter going through a quick example, everybody got back to work in groups and one hour later we had indeed a list of Informations ranked by their relative value.\n\nThe mental trick of this \"Equation\" allowed everyone to wrap their heads around the concept of Information Value in a natural way.\n\n# Information have no Value, Decisions do\n\nIntroducing the _Decision_ concept allowed to understand where does the Value come from in a digital. Sometimes, a single concept allows to build a bridge between two others. Without that, you might be pretty helpless to connect the two, like our executives in our workshop.\n\nThanks to this equation, I have been able to guide people through workshops to draft a proper digital business case quickly. Letting them draft their ideas and plugging them into the Information-Decision-Value is a powerful mean to assess the value of their ideas.\n\nIn a broader perspective, this Equation shows that Information has intrinsically no Value by itself. The real vector of Value creation are Decisions made by Humans.\n\n> This is my first blog post: please share your feedbacks to help me make this as enjoyable and interesting as it could !\n"
}