{
  "title": "How to Value Information",
  "tags": [
    {
      "tag": "Business",
      "icon": "domain"
    },
    {
      "tag": "Digitalization",
      "icon": "blur"
    },
    {
      "tag": "Humans",
      "icon": "account"
    },
    {
      "tag": "Machines",
      "icon": "robot"
    }
  ],
  "date": "2019-01-02T17:00:00+01:00",
  "thumbnail": "/images/uploads/pexels-photo-1706607.jpeg",
  "summary": "Valuing an information is difficult because it is highly contextual. However, a single concept can help you better understand information value & establish quickly a business case for a digital project.",
  "body": "## Brainstorming on Digital Business Ideas Can Be Confusing\n\nSeveral weeks ago, a senior colleague called me to help him organize a workshop with his clients. The goal was to help some high profile executives to find relevant use-cases for new digital projects. We didn't have much time to prepare, so the plan we proposed was simple:\n- summarize all the databases they know they have at hand\n- brainstorm on what valuable information we can derive from it\n- make a basic value assessment of each idea.\n\nIn the end, we would do a collective voting on what ideas seemed the most valuable and accessible to start a project.\n\nThe workshop began. We were in a old room, with carpet on the walls and where a huge oval table occupied most of the place. This room was more suited to have hours-long boring corporate meetings than for a productive and creative workshop. The setup was suboptimal, but at least there was two white-boards we could use. We began the setup.\n\nThe workshop started well. Those executives had a great sharing mindset and quickly we identified all kinds of databases they were using in their daily professional life. Collaboratively, we found several ideas of new useful information we could derive: forecasts, aggregates, predictions, etc. We had eaten half of the time and everything went smoothly during that phase: the divergence phase.\n\nThen we started the second phase: the convergence. _\"Now that we have identified new informations we can create, let's assess their value and rank them.\"_\n\nIt was half past 16: people's listening abilities start to decline at that point. Indeed, the executives we had in the room were really having trouble agreeing on the relative value of each information. Discussions were going round in circles. In fact, nobody in the room was able to put a clear figure on the value.\n\nIn fact, they were discovering the fact that **Information Value is highly contextual**. The value of information depends on how you use it. How can we determine its value then ?\n\n## The Information Value Equation\n\nInformation is intangible and can be duplicated at will without any cost. So, at first sight, since its marginal cost of production is near zero, one could argue that information value would be theoretically zero. However, seeing today's digital economy, we can witness that information is highly valuable. How this intangible information relates to the tangible, physical world ?    \n\nRonald Howard, a professor of Engineering-Economic systems at Stanford University, brought a solution to this paradox in 1966 in his paper _Information Value Theory_:\n> \"The value of information arises from the probabilistic and economic factors that affect decisions.\" ([Howard, 1966](https://doi.org/10.1109/TSSC.1966.300074))\n\nIn other words, information is valuable because it affects our decisions. Or, said in another way: information value is \"How much answering a question allows a decision-maker to improve its decision\".\n\nLet's take the example of weather forecasts:\n\n- Working in an office, I don't need to know the weather very precisely, only to know if I have to grab an umbrella before leaving or not. \"Should I grab an umbrella ?\" is the key decision here. Several outcomes from this decision: If it rains but I don't have an umbrella, I'll get soaked and I can live with it. That's why I wouldn't pay for 1-day-in-advance weather forecast.\n\n- Imagine now that I'm organizing a promotional event for my company in 2 weeks. The event takes place outside. I've already spent money to organize the event, but I haven't rented a tent, because I think that the weather will be nice. The key decision here is \"Should I rent a tent ?\".\n  - A weather forecast now tells me that there is a 30% chance that it will rain that day. I decide to not rent that tent because I don't want to spend money to protect myself from an event that is too unlikely and I will cancel the event at the last minute if needed.\n  - Later, another forecast tells me that there is a 90% chance that it will rain that day: this time, I decide to rent a tent because canceling the event is a waste of money that is becoming more and more likely.\n\nDepending on the cost I've already spent on the event, the cost of renting a tent & the known likelihood of raining that day will change my decision of renting that tent or not. This information has value in this context: it means real money for me & the company renting the tent !\n\nThe simplest way to put it is with this equation, which I call the _Information Value Equation_:\n\n> **📊 Information + ✋ Decision = 💰 Value**\n\nIt is not a real equation, but it is a good mnemonics to remember the interaction between those 3 concepts. No decision, no value !\n\n## Use the Information Value Equation on the Spot\n\nGetting back to the workshop with the executives: as they couldn't agree on information value, discussions were going round in circles. People were starting to have weird looks at my colleague and I, kind of saying: _\"Where are we going with this workshop ?\"_.\n\nAt that point our white-boards had 2 columns: _Information_ & _Value_. And the \"Value\" column was desperately empty.\n\n| Information | Value |\n|:------:|:------:|\n|Predicted next month stock|?|\n|...|?|\n\nClearly, this wasn't the right tool to understand & assess the value of each information. It was more misleading than helping them.\n\nI came up with the idea of this _Information Value Equation_ while writing my MBA thesis several weeks before. Feeling that we were stuck, I decided to give it a go: I gathered the participants around me, explained them the Information Value Equation and then I simply draw the _Decision_ column between the _Information_ & _Value_ columns. That way, the link could be done easily visually.\n\n|Information|Decision|Value|\n|:--:|:--:|:--:|\n|Predicted next month stock|How many stuff should I produce this month ?|?|\n|...|...|?|\n\nAfter going through a quick example, everybody got back to work in groups and one hour later we had indeed a list of informations ranked by their relative value.\n\nThe mental trick of this \"Equation\" allowed everyone to wrap their heads around the concept of information value in a natural way.\n\n## Information Has No Value, Decisions Do\n\nAnalyzing information in terms of decisions allowed to understand where does the value come from in a digital. Sometimes, a single concept allows to build a bridge between two others. Without that concept, you might be pretty helpless to connect the two others, that's what was happening to our executives in our workshop.\n\nThanks to this equation, I have been able to guide people through workshops to draft a proper digital business case quickly. Letting them draft their ideas and plugging them into the Information-Decision-Value framework is a powerful mean to assess the value of their ideas.\n\nIn a broader perspective, this equation suggests that information has intrinsically no value by itself. The real vector of value creation are the decisions made by Humans.\n\n> This is my first blog post: please share your feedbacks to help me make this as enjoyable and interesting as it could !\n"
}