{
  "title": "About This Blog ",
  "tags": [],
  "date": "2018-12-27T00:16:28+01:00",
  "thumbnail": "/images/uploads/pexels-photo-1108812.jpeg",
  "summary": "Why bother starting a blog in 2019 ? Here are some explanations about the purpose of this blog and who I am.",
  "body": "Hello dear reader,\n\nThis articles aims at explaining what's the purpose of this blog and who I am.\n\n## Why This Blog ?\n\nWhen you think of it, we are all living in a complex mesh of humans & machines interacting together through multiple networks. And we have always been, in a way. Before the industrial age, even if machines were less important, they have played a major role in the building of complex societies. Think about Gutenberg's printing press.\n\nSome things don't change: the information we exchange has always been growing: the network is always becoming faster & more dense.\n\nSome things change: it seems that we have more and more machines helping us to manage information: creating, storing, sorting, searching information. Machines seem to become more and more important (influential ?) in this mesh.\n\nThis kind of thought arose within me when I discovered the [Actor-Network Theory](https://en.wikipedia.org/wiki/Actor%E2%80%93network_theory), a field of sociology where:\n> everything in the social and natural worlds exists in constantly shifting networks of relationship.\n\nI recently found that Tim O'Reilly was sharing a similar way of seeing the world in his recent book [_What's The Future_](https://www.oreilly.com/tim/wtf-book.html):\n> Increasingly, I’d been watching a kind of Cambrian explosion in applications for collective intelligence [...]. Billions of connected humans and devices were being woven into a global brain. That brain was all of us, augmented and connected.\n\nAnother way of saying that we are tiny actors in a big network, like a brain.\n\nThat's what I want to discuss and share in this blog.\n\n### Manifesto of This blog\n\nHere are the convictions I wish to question & share through this blog:\n\n- The future will be build by people able to communicate efficiently with humans & machines.\n  - _communicating efficiently_ means communicating with a high impact in terms of number of humans or machines impacted and in terms of relevancy & durability of the information transmitted: How many people & machines can I impact ? How well can I change their behaviour ?\n  - _communicating with humans_ appeals to social skills, emotional intelligence, arts. Either through real life contact or through machines (social networks).\n  - _communicating with machines_ appeals to engineering, coding, data science.\n- People able to master both types of communication, i.e. people able to communicate both with humans & machines, will create exceptional value.\n\n#### Topics I'd Like to Cover\n\nHere is a list of topics I wish to discuss in this blog:\n\n##### About Machines:\n- What is information value ?\n- How to transmit information to Machines: Why coding is more and more important\n- Devops: A philosophy to code for robustness & long-term value\n- Data Science as the new way to do problem solving\n- Neural networks are not magic: explained step by step: bagging & boosting of simple functions\n- Tooling to code in Python for data science: going beyond Jupyter thanks to Atom & Anaconda.\n- Coding best practices: python virtualenv & requirements.txt\n- Coding best practices: using git & github PRs\n- Coding best practices: devops & test-driven development on gitlab with python\n- How to communicate between machines: part 1: REST\n- How to communicate between machines: part 2: SQL\n- How to communicate between machines: part 3: GraphQL\n- Replacing Microsoft office tools with open-source markdown-based alternatives (reveal.js ...)\n- Project numbering done right: [semantic versioning](http://semver.org/)\n- Hacking without admin rights in corporate environments: using & configuring anaconda with proxy\n- What is a static site ? Pros & Cons ? How to make one ?\n- Exponential organizations: a new paradigm based on near zero marginal costs: how to apply 6-sigma to automation\n\n##### About Humans & Organizations:\n- Actor-Network theory or how to visualize our world in networks\n- How to communicate efficiently and the case against email and how to communicate efficiently\n- Transactional analysis as a tool to understand relations between humans\n- How to transmit information to humans: The value of our attention\n- Non-Violent communication is the best \"protocol\" to communicate between humans\n- Neuro-linguistic programming and the importance of non-verbal communication between humans (a \"hidden protocol\")\n- Meditation as a tool to influence our attention & cognitive processes (HRV) and understand our emotions (TED talk Amy Cudy)\n- Empathy & Design Thinking as universal tools to understand & create value\n- The most useful skills & behaviours for the digital era\n- How to analyze Organizational value creation with Treacy's Value Discipline & Colin's Tech Firm characteristics\n- The case for rationality and how to measure the efficiency of an organization\n- Effectuation or the key behaviours to have impact on the world and change our attitude towards risk to innovate more\n- How to organize collective problem-solving: the 3 main ingredients of a successful & efficient project\n- How to engineer human decision-making & reduce friction thanks to Nudges\n- Understanding Cognitive biases with fast (automatic) & slow (rational) thinking (from Daniel Kahnemann)\n- How to better learn thanks spaced repetition\n- How to start reflow your attention thanks to nudges (e.g: to start meditation, to read more, ...)\n- How to analyze our emotions (SCARF model)\n- Digital communication or \"the Era of Anger\": why anger is so viral ?\n- Humans are fondamentally irrational: How our emotions are precursors of our rational thinking (Damasio)\n- Mistaking money with value & the world's financialization: the common point between middle classes demotion, mass unemployment, bullshit jobs, slowing productivity gains & growing capital concentration.\n- Universal Basic Income vs Quantitative Easing: a story about order of magnitude.\n- Rational communication: the case against numbers (stats) without confidence intervals\n- Rational thinking: what is p-value, how is it used by scientists to question their decisions\n- Growth mindset: from a terrible loss to a successful learning (a story about stockmarket & inheritance)\n\n## Who Am I ?\n\nMy name is Quentin Chenevier. I live in [Toulouse, France](https://www.google.com/maps/place/Toulouse).\n\n### Why I Love Machines\n\nI've followed a very rational & maths-based cursus & studied many different machines: I'm really happy to study complex systems built by Humans.\n\nI graduated in 2010 from the [Ecole Polytechnique](https://www.polytechnique.edu/en), with a major in remote sensing, where I studied. From there, I had the opportunity to work on amazingly complex machines which evolve in all kind of environments:\n* In space, like [spectrometers](https://en.wikipedia.org/wiki/Infrared_atmospheric_sounding_interferometer)\n* In the sky, like [cockpits](https://en.wikipedia.org/wiki/Cockpit)\n* In the cloud (haha), like [data science apps](http://www.airbus.com/newsroom/press-releases/en/2017/06/airbus-launches-new-open-aviation-data-platform--skywise--to-sup.html)\n\nAll those machines have one thing in common: they process huge amounts of information.\n\n### Why I Love Humans\n\nWhen I started meditation in 2016, it has helped me to better understand my own thinking processes and having more empathy for others. As a result, I started to read a lot about psychology, sociology and cognitive sciences. Since then, the beauty of the Human's mind and the complexity of its inner workings has never stopped to amaze me.\n\nI also graduated an MBA in 2018 from the [Toulouse Business School](http://www.tbs-education.fr/en), which is a great place to learn business & management and to start learning about sociology. From there, I began to be passionate about how organizations work. After all, they are complex systems made of Humans & Machines made by Humans.\n\n# Contact\n\nI would by happy to discuss with you, feel free to contact me:\n* on twitter: [@q_chenevier](https://twitter.com/q_chenevier)\n* on linkedin: [@qchenevier](https://www.linkedin.com/in/qchenevier/)\n* on medium: [@qchenevier](https://medium.com/@qchenevier)\n"
}